:PREAMBLE:
#+title: Epkgs: Melpa
#+setupfile: .orgconfig
#+name: setup
#+begin_src emacs-lisp :results silent
  (require 'emir)
#+end_src
[[https://emacsmirror.net/stats][up]]
:END:
* Missing from Melpa

The below packages, which are available from the Emacsmirror, are
missing from Melpa.  Not all of those packages should be added to
Melpa (in fact most of them shouldn't), and if you decide to submit
recipes for some of them, then please first make sure they meet the
minimal requirements.

Also see https://github.com/melpa/melpa/issues/7892.

** Github
#+name: missing-github
#+begin_src emacs-lisp
  (epkg-with-org-header ("Package" "Modified" "Link" "Summary")
    (cl-sort
     (-keep (pcase-lambda (`(,name ,summary))
              (and (not (melpa-get name))
                   (not (gelpa-get name))
                   (list name
                         (with-emir-repository (epkg name)
                           (magit-git-string
                            "log" "-1" "--format=%cd" "--date=short"))
                         ;; (and (member name emir--archived-packages) t)
                         (epkg-org-link name)
                         (and summary (truncate-string-to-width
                                       (string-replace "|" ";" summary) 70)))))
            (epkgs [name summary] 'epkg-github-package))
     #'string> :key #'cadr))
#+end_src
#+results: missing-github
| Package (549)                |   Modified | Link                                    | Summary                                                                |
|------------------------------+------------+-----------------------------------------+------------------------------------------------------------------------|
| emacspeak                    | 2022-08-15 | [[https://github.com/tvraman/emacspeak][tvraman/emacspeak]]                       | The Complete Audio Desktop                                             |
| eaf                          | 2022-08-14 | [[https://github.com/emacs-eaf/emacs-application-framework][emacs-eaf/emacs-application-framework]]   | Emacs application framework                                            |
| eaf-browser                  | 2022-08-12 | [[https://github.com/emacs-eaf/eaf-browser][emacs-eaf/eaf-browser]]                   | Browser plugins                                                        |
| mu4e                         | 2022-08-11 | [[https://github.com/djcb/mu][djcb/mu]]                                 | Part of mu4e, the mu mail user agent                                   |
| fzf-native                   | 2022-08-08 | [[https://github.com/dangduc/fzf-native][dangduc/fzf-native]]                      | Fuzzy completion style                                                 |
| git-undo                     | 2022-08-07 | [[https://github.com/jwiegley/git-undo-el][jwiegley/git-undo-el]]                    | Revert region to most recent Git historical version                    |
| eaf-file-manager             | 2022-08-03 | [[https://github.com/emacs-eaf/eaf-file-manager][emacs-eaf/eaf-file-manager]]              | File manager                                                           |
| org-extra-emphasis           | 2022-08-02 | [[https://github.com/QiangF/org-extra-emphasis][QiangF/org-extra-emphasis]]               | Extra Emphasis markers for Org                                         |
| eaf-pdf-viewer               | 2022-07-30 | [[https://github.com/emacs-eaf/eaf-pdf-viewer][emacs-eaf/eaf-pdf-viewer]]                | PDF Viewer                                                             |
| ultratex                     | 2022-07-28 | [[https://github.com/jhpalmieri/ultratex][jhpalmieri/ultratex]]                     | Ultra-TeX mode                                                         |
| straight                     | 2022-07-21 | [[https://github.com/radian-software/straight.el][radian-software/straight.el]]             | Next-generation package manager                                        |
| egit                         | 2022-07-19 | [[https://github.com/jimhourihan/egit][jimhourihan/egit]]                        | Emacs git commit history interface ala gitk and qgit                   |
| movie                        | 2022-07-15 | [[https://github.com/larsmagne/movie.el][larsmagne/movie.el]]                      | Playing movies                                                         |
| snails                       | 2022-07-13 | [[https://github.com/manateelazycat/snails][manateelazycat/snails]]                   | A modern, easy-to-expand fuzzy search framework                        |
| awesome-tab                  | 2022-07-05 | [[https://github.com/manateelazycat/awesome-tab][manateelazycat/awesome-tab]]              | Provide an out of box configuration to use tab in Emacs                |
| flxy                         | 2022-07-04 | [[https://github.com/jcs-elpa/flxy][jcs-elpa/flxy]]                           | Fast, character-based search library in Rust                           |
| github-tags                  | 2022-07-04 | [[https://github.com/jcs-elpa/github-tags][jcs-elpa/github-tags]]                    | Retrieve tags information through GitHub API                           |
| sublime-fuzzy                | 2022-07-04 | [[https://github.com/jcs-elpa/sublime-fuzzy][jcs-elpa/sublime-fuzzy]]                  | Fuzzy matching algorithm like Sublime Text's string search             |
| mini-popup                   | 2022-07-02 | [[https://github.com/minad/mini-popup][minad/mini-popup]]                        | Show the minibuffer in a popup                                         |
| flx-rs                       | 2022-06-30 | [[https://github.com/jcs-elpa/flx-rs][jcs-elpa/flx-rs]]                         | Flx in Rust using dynamic module                                       |
| pymacs                       | 2022-06-24 | [[https://github.com/dgentry/Pymacs][dgentry/Pymacs]]                          | Interface between Emacs Lisp and Python                                |
| touchgrid                    | 2022-06-19 | [[https://github.com/larsmagne/touchgrid.el][larsmagne/touchgrid.el]]                  | Executing actions based on input events                                |
| fuz-bin                      | 2022-06-17 | [[https://github.com/jcs-elpa/fuz-bin][jcs-elpa/fuz-bin]]                        | Fast and precise fuzzy scoring/matching utils                          |
| eaf-terminal                 | 2022-06-16 | [[https://github.com/emacs-eaf/eaf-terminal][emacs-eaf/eaf-terminal]]                  | Terminal plugins                                                       |
| epithet                      | 2022-06-15 | [[https://github.com/oantolin/epithet][oantolin/epithet]]                        | Rename buffers with descriptive names                                  |
| speechd                      | 2022-06-08 | [[https://github.com/brailcom/speechd-el][brailcom/speechd-el]]                     | Library for accessing Speech Dispatcher                                |
| smartchr                     | 2022-06-06 | [[https://github.com/imakado/emacs-smartchr][imakado/emacs-smartchr]]                  | Emacs version of smartchr.vim                                          |
| emir                         | 2022-05-12 | [[https://github.com/emacscollective/emir][emacscollective/emir]]                    | Maintain the Emacsmirror                                               |
| dumbparens                   | 2022-05-08 | [[https://github.com/radian-software/dumbparens][radian-software/dumbparens]]              | Simple paren-matching solution                                         |
| guess-tex-master             | 2022-05-05 | [[https://github.com/mattfidler/guess-tex-master.el][mattfidler/guess-tex-master.el]]          | Guess LaTeX Master File                                                |
| bookiez                      | 2022-04-15 | [[https://github.com/larsmagne/bookiez.el][larsmagne/bookiez.el]]                    | Managing Books                                                         |
| cddb                         | 2022-04-15 | [[https://github.com/larsmagne/cddb.el][larsmagne/cddb.el]]                       | Cddb interface                                                         |
| dae                          | 2022-04-15 | [[https://github.com/larsmagne/dae.el][larsmagne/dae.el]]                        | Digital Audio Extraction                                               |
| eval-server                  | 2022-04-15 | [[https://github.com/larsmagne/eval-server.el][larsmagne/eval-server.el]]                | A framework for doing client/server things                             |
| musicbrainz                  | 2022-04-15 | [[https://github.com/larsmagne/musicbrainz.el][larsmagne/musicbrainz.el]]                | Musicbrainz interface                                                  |
| pvr                          | 2022-04-15 | [[https://github.com/larsmagne/pvr.el][larsmagne/pvr.el]]                        | Personal Video Recorder                                                |
| scan                         | 2022-04-15 | [[https://github.com/larsmagne/scan.el][larsmagne/scan.el]]                       | Scanning Sleeves                                                       |
| tellstick                    | 2022-04-15 | [[https://github.com/larsmagne/tellstick.el][larsmagne/tellstick.el]]                  | Controlling tellstick controllers                                      |
| ga                           | 2022-04-06 | [[https://github.com/xwl/ga][xwl/ga]]                                  | Generic apt alike interfaces for various package management tools      |
| eaf-video-player             | 2022-03-30 | [[https://github.com/emacs-eaf/eaf-video-player][emacs-eaf/eaf-video-player]]              | Video player                                                           |
| eaf-airshare                 | 2022-03-29 | [[https://github.com/emacs-eaf/eaf-airshare][emacs-eaf/eaf-airshare]]                  | Airshare plugins                                                       |
| nyan-prompt                  | 2022-03-21 | [[https://github.com/PuercoPop/nyan-prompt][PuercoPop/nyan-prompt]]                   | Nyan Cat on the eshell prompt                                          |
| org-velocity                 | 2022-03-20 | [[https://github.com/ruricolist/org-velocity][ruricolist/org-velocity]]                 | Something like Notational Velocity for Org                             |
| buffer-action                | 2022-03-03 | [[https://github.com/xwl/buffer-action][xwl/buffer-action]]                       | Perform actions(compile/run, etc) in buffer based on mode/filename     |
| director                     | 2022-01-21 | [[https://github.com/bard/emacs-director][bard/emacs-director]]                     | Simulate user sessions                                                 |
| polyp                        | 2021-11-26 | [[https://github.com/minad/polyp][minad/polyp]]                             | Nested transient menus                                                 |
| uchronia                     | 2021-11-26 | [[https://github.com/minad/uchronia][minad/uchronia]]                          | Uchronia mode                                                          |
| math-delimiters              | 2021-10-28 | [[https://github.com/oantolin/math-delimiters][oantolin/math-delimiters]]                | Insert math delimiters in TeX, LaTeX and Org buffers                   |
| infix                        | 2021-09-14 | [[https://github.com/rspeele/infix-dot-el][rspeele/infix.el]]                        | Infix operators for Emacs Lisp                                         |
| sclang                       | 2021-09-04 | [[https://github.com/supercollider/scel][supercollider/scel]]                      | IDE for working with the SuperCollider language                        |
| latch                        | 2021-08-11 | [[https://github.com/skeeto/elisp-latch][skeeto/elisp-latch]]                      | Promises and latches for Elisp                                         |
| dictem                       | 2021-07-28 | [[https://github.com/cheusov/dictem][cheusov/dictem]]                          | DICT protocol client (rfc-2229) for [X]Emacs                           |
| text-align                   | 2021-07-12 | [[https://github.com/akicho8/text-align][akicho8/text-align]]                      | スペースを削除してカラムを揃える                                       |
| live-completions             | 2021-07-09 | [[https://github.com/oantolin/live-completions][oantolin/live-completions]]               | Live updating of the *Completions* buffer                              |
| goby                         | 2021-07-07 | [[https://github.com/kazu-yamamoto/Goby][kazu-yamamoto/Goby]]                      | WYSIWYG presentation tool                                              |
| ob-mathematica               | 2021-05-05 | [[https://github.com/tririver/ob-mathematica][tririver/ob-mathematica]]                 | Org-babel functions for Mathematica evaluation                         |
| trindle                      | 2021-05-05 | [[https://github.com/daic-h/trindle][daichirata/trindle]]                      | Simple Emacs LISP management extension                                 |
| icons-in-terminal            | 2021-05-04 | [[https://github.com/sebastiencs/icons-in-terminal][sebastiencs/icons-in-terminal]]           |                                                                        |
| mailcrypt                    | 2021-05-04 | [[https://github.com/barak/mailcrypt][barak/mailcrypt]]                         | Mail encryption with PGP                                               |
| mv-shell                     | 2021-05-04 | [[https://github.com/nflath/mv-shell][nflath/mv-shell]]                         | Keep buffers in sync with filename throughout 'mv'commands in shell-mo |
| zone-matrix                  | 2021-05-01 | [[https://github.com/ober/zone-matrix][ober/zone-matrix]]                        | The matrix screen saver on Emacs                                       |
| frame-ctr                    | 2021-04-15 | [[https://github.com/takaxp/frame-ctr][takaxp/frame-ctr]]                        | A tool to control frame size, position, and font size                  |
| dired-hacks                  | 2021-04-03 | [[https://github.com/Fuco1/dired-hacks][Fuco1/dired-hacks]]                       | Utilities and helpers for dired-hacks collection                       |
| ess-stata-mode               | 2021-03-25 | [[https://github.com/emacs-ess/ess-stata-mode][emacs-ess/ess-stata-mode]]                | Stata customization                                                    |
| mark-forward-sexp            | 2021-03-10 | [[https://github.com/rlister/mark-forward-sexp][rlister/mark-forward-sexp]]               | Mark regions sematically inside balanced expressions                   |
| velocity                     | 2021-01-31 | [[https://github.com/bard/emacs-velocity][bard/emacs-velocity]]                     | Search, browse, create text in multiple formats                        |
| tenv                         | 2021-01-26 | [[https://github.com/aki2o/elisp-test][aki2o/elisp-test]]                        | Provide functions for test environment building                        |
| placeholder                  | 2021-01-14 | [[https://github.com/oantolin/placeholder][oantolin/placeholder]]                    | Easy insertion and filling of placeholders in text                     |
| jda                          | 2020-12-29 | [[https://github.com/jglee1027/jda-minor-mode][jglee1027/jda-minor-mode]]                | Jong-Gyu Development Assistant minor mode for Developers               |
| completing-history           | 2020-12-10 | [[https://github.com/oantolin/completing-history][oantolin/completing-history]]             | Insert history items with completion                                   |
| epackage                     | 2020-11-28 | [[https://github.com/jaalto/project--emacs-epackage][jaalto/project--emacs-epackage]]          | Distributed Emacs Lisp Package System (DELPS)                          |
| dired-view                   | 2020-11-14 | [[https://github.com/xwl/dired-view][xwl/dired-view]]                          | Dired view mode                                                        |
| rd-mode                      | 2020-10-29 | [[https://github.com/uwabami/rdtool][uwabami/rdtool]]                          | Major mode for RD editing                                              |
| frame-bufs                   | 2020-10-22 | [[https://github.com/alpaker/frame-bufs][alpaker/frame-bufs]]                      | A minor mode for frame-relative buffer lists                           |
| org-protocol-github-lines    | 2020-08-25 | [[https://github.com/kidd/org-protocol-github-lines][kidd/org-protocol-github-lines]]          | Open files and lines in emacs from your browser (when on github)       |
| e2wm-perspb                  | 2020-08-05 | [[https://github.com/aki2o/e2wm-perspb][aki2o/e2wm-perspb]]                       | Plugin of e2wm.el for buffer list of persp-mode.el                     |
| sallet                       | 2020-08-02 | [[https://github.com/Fuco1/sallet][Fuco1/sallet]]                            | Select candidates in a buffer                                          |
| lookup                       | 2020-08-01 | [[https://github.com/lookup2/lookup2][lookup2/lookup2]]                         | Search interface to electronic dictionaries                            |
| explain-pause-mode           | 2020-07-27 | [[https://github.com/lastquestion/explain-pause-mode][lastquestion/explain-pause-mode]]         | Explain emacs pauses                                                   |
| i3                           | 2020-06-09 | [[https://github.com/vava/i3-emacs][vava/i3-emacs]]                           | Bindings for i3 WM IPC                                                 |
| async-completing-read        | 2020-05-30 | [[https://github.com/oantolin/async-completing-read][oantolin/async-completing-read]]          | An async-capable completing read function                              |
| restricto                    | 2020-05-17 | [[https://github.com/oantolin/restricto][oantolin/restricto]]                      | Restrict to current minibuffer completion candidates                   |
| metapost-mode+               | 2020-05-04 | [[https://github.com/liyu1981/metapost-mode-][liyu1981/metapost-mode-]]                 | Drawing with metapost interactively in Emacs                           |
| yaol                         | 2020-05-03 | [[https://github.com/aki2o/yaol-el][aki2o/yaol-el]]                           | Yet another outline                                                    |
| distel                       | 2020-02-03 | [[https://github.com/massemanet/distel][massemanet/distel]]                       | Top-level of distel package, loads all subparts                        |
| asciidoc                     | 2019-11-28 | [[https://github.com/metaperl/asciidoc-el][metaperl/asciidoc-el]]                    | Asciidoc text file development support                                 |
| cc-chainsaw                  | 2019-11-25 | [[https://github.com/abo-abo/cc-chainsaw][abo-abo/cc-chainsaw]]                     | A few tricks to make c++-mode go                                       |
| pdfscan                      | 2019-11-11 | [[https://github.com/larsmagne/pdfscan.el][larsmagne/pdfscan.el]]                    | Scanning and cropping                                                  |
| manued                       | 2019-10-17 | [[https://github.com/yamauchih/manued][yamauchih/manued]]                        | A minor mode of manued proofreading method                             |
| expectations-mode            | 2019-06-19 | [[https://github.com/gar3thjon3s/expectations-mode][clojure-expectations/expectations-mode]]  | Minor mode for expectations tests                                      |
| emux                         | 2019-06-09 | [[https://github.com/re5et/emux][re5et/emux]]                              | Emacs Lisp Behaviour-Driven Development framework                      |
| insert-time                  | 2019-06-03 | [[https://github.com/rmm5t/insert-time.el][rmm5t/insert-time.el]]                    | Insert time and date stamps at point                                   |
| seognil                      | 2019-04-13 | [[https://github.com/md11235/seognil][md11235/seognil]]                         | Query words in massaged dictionaries in lingoes format                 |
| helm-words                   | 2019-03-12 | [[https://github.com/pronobis/helm-words][pronobis/helm-words]]                     | Helm extension for looking up words in dictionaries and thesauri       |
| exim                         | 2019-02-06 | [[https://github.com/ch11ng/exim][ch11ng/exim]]                             | Emacs X Input Method                                                   |
| org-passwords                | 2019-01-02 | [[https://github.com/alfaromurillo/org-passwords.el][alfaromurillo/org-passwords.el]]          | Org derived mode for managing passwords                                |
| youtube-dl                   | 2018-10-12 | [[https://github.com/skeeto/youtube-dl-emacs][skeeto/youtube-dl-emacs]]                 | Manages a youtube-dl queue                                             |
| esv                          | 2018-10-08 | [[https://github.com/csebold/esv.el][csebold/esv.el]]                          | Support for Crossway's ESV API in Emacs                                |
| pylookup                     | 2018-08-19 | [[https://github.com/tsgates/pylookup][tsgates/pylookup]]                        | Look up python documents (reference) in Emacs                          |
| bidi                         | 2018-04-17 | [[https://github.com/kensanata/emacs-bidi][kensanata/emacs-bidi]]                    | Bidi support for Emacs                                                 |
| erobot                       | 2018-03-21 | [[https://github.com/kensanata/erobot][kensanata/erobot]]                        | Game with elisp functions trying to survive                            |
| htmlr                        | 2018-03-21 | [[https://github.com/kensanata/htmlr][kensanata/htmlr]]                         | HTML rendering in Elisp                                                |
| sql-transform                | 2018-03-21 | [[https://github.com/kensanata/sql-transform][kensanata/sql-transform]]                 | Transform SQL statements                                               |
| borg-queen                   | 2018-03-15 | [[https://github.com/thblt/borg-queen][thblt/borg-queen]]                        | Manage, install and upgrade Borg drones                                |
| uzumaki                      | 2018-03-15 | [[https://github.com/geyslan/uzumaki][geyslan/uzumaki]]                         | A simple buffer cycler                                                 |
| 1000-words                   | 2018-03-02 | [[https://github.com/kensanata/1000-words][kensanata/1000-words]]                    | Limit yourself to the most common words while writing                  |
| eval-sexp-in-comments        | 2018-03-02 | [[https://github.com/kensanata/eval-sexp-in-comments][kensanata/eval-sexp-in-comments]]         | Evaluate sexps in comments                                             |
| really-simple-wiki           | 2018-03-02 | [[https://github.com/kensanata/really-simple-wiki][kensanata/really-simple-wiki]]            | Edit local raw wiki pages                                              |
| git-find-file                | 2018-02-25 | [[https://github.com/marktriggs/git-find-file.el][marktriggs/git-find-file.el]]             | Incremental search for files in a git repo                             |
| spiral                       | 2018-02-23 | [[https://github.com/volrath/spiral][volrath/spiral]]                          | Clojure IDE based on UNREPL                                            |
| quickfix-mode                | 2018-02-19 | [[https://github.com/ulises/quickfix-mode][ulises/quickfix-mode]]                    | A mode for quickfixing common programming errors                       |
| gnus-harvest                 | 2018-02-08 | [[https://github.com/jwiegley/gnus-harvest][jwiegley/gnus-harvest]]                   | Harvest e-mail address from read/written articles                      |
| jaunte                       | 2018-02-02 | [[https://github.com/kawaguchi/jaunte][kawaguchi/jaunte]]                        | Cursor teleportation                                                   |
| toolbox                      | 2018-01-28 | [[https://github.com/kensanata/toolbox][kensanata/toolbox]]                       | Create simple menus in buffers                                         |
| unparen                      | 2018-01-28 | [[https://github.com/kensanata/unparen][kensanata/unparen]]                       | Show elisp code without parenthesis'                                   |
| inf-php                      | 2018-01-22 | [[https://github.com/taksatou/inf-php][taksatou/inf-php]]                        | Run a php interactive shell in a buffer                                |
| mvc                          | 2018-01-21 | [[https://github.com/wachikun/mvc][wachikun/mvc]]                            | M(eta;ulti;enu) Version Control Interface                              |
| wiki                         | 2018-01-14 | [[https://github.com/kensanata/wiki][kensanata/wiki]]                          | Hypertext authoring the WikiWay                                        |
| idle-scroll                  | 2018-01-10 | [[https://github.com/kensanata/idle-scroll][kensanata/idle-scroll]]                   | Scroll down a line when Emacs is idle                                  |
| loops                        | 2018-01-10 | [[https://github.com/kensanata/loops][kensanata/loops]]                         | Detect loops in lists                                                  |
| kdic                         | 2018-01-09 | [[https://github.com/kensanata/kdic][kensanata/kdic]]                          | Practice your Kanji using a dictionary                                 |
| fs-mode                      | 2018-01-07 | [[https://github.com/suzp1984/fs-mode][suzp1984/fs-mode]]                        | Linux file system menagement                                           |
| sunrise-commander            | 2017-12-17 | [[https://github.com/escherdragon/sunrise-commander][escherdragon/sunrise-commander]]          | Two-pane file manager for Emacs based on Dired and inspired by MC      |
| festival                     | 2017-12-14 | [[https://github.com/davep/festival.el][davep/festival.el]]                       | Emacs interface into festival                                          |
| sysuplist-mode               | 2017-11-27 | [[https://github.com/mrBliss/sysuplist-mode][mrBliss/sysuplist-mode]]                  | Emacs Major mode for Yaourt's update selection                         |
| font-lock-ext                | 2017-10-30 | [[https://github.com/sensorflo/font-lock-ext][sensorflo/font-lock-ext]]                 | Extensions to Emacs font-lock.el                                       |
| test-framework               | 2017-10-23 | [[https://github.com/epsil/test-framework.el][epsil/test-framework.el]]                 | Framework for unit testing                                             |
| reddit-mode                  | 2017-09-28 | [[https://github.com/death/reddit-mode][death/reddit-mode]]                       | Support for the Reddit time sink                                       |
| org-hyde                     | 2017-09-22 | [[https://github.com/punchagan/org-hyde][punchagan/org-hyde]]                      | Export hyde-ready posts from org-mode entries                          |
| tap-mode                     | 2017-09-13 | [[https://github.com/renormalist/emacs-tap-mode][renormalist/emacs-tap-mode]]              | Major mode for editing .tap-files                                      |
| etexshow                     | 2017-09-03 | [[https://github.com/pgundlach/etexshow][pgundlach/etexshow]]                      | Browser for ConTeXt commands                                           |
| org-daypage                  | 2017-09-02 | [[https://github.com/almost/org-daypage][almost/org-daypage]]                      | Org-Mode Day Page                                                      |
| lsdb                         | 2017-08-26 | [[https://github.com/ikazuhiro/lsdb][ikazuhiro/lsdb]]                          | The Lovely Sister Database                                             |
| cycle-buffer                 | 2017-08-17 | [[https://github.com/VladimirAlexiev/emacs-cycle-buffer][VladimirAlexiev/emacs-cycle-buffer]]      | Select buffer by cycling through                                       |
| swallow-window               | 2017-08-17 | [[https://github.com/pd/swallow-window.el][pd/swallow-window.el]]                    | Grow the current window into the space occupied by neighboring windows |
| ecco                         | 2017-08-16 | [[https://github.com/capitaomorte/ecco][joaotavora/ecco]]                         | A port of docco                                                        |
| igor-mode                    | 2017-08-16 | [[https://github.com/yamad/igor-mode][yamad/igor-mode]]                         | Major mode for editing Igor Pro procedure files                        |
| paredit-c                    | 2017-08-16 | [[https://github.com/dandavison/paredit-c][dandavison/paredit-c]]                    | Paredit mode for C-style languages                                     |
| show-arglist                 | 2017-08-16 | [[https://github.com/peccu/show-arglist.el][peccu/show-arglist.el]]                   | Showing arglist of function at point                                   |
| sentence-highlight           | 2017-08-12 | [[https://github.com/sbelak/sentence-highlight][sbelak/sentence-highlight]]               | Highlight the current sentence                                         |
| chumpy-windows               | 2017-08-09 | [[https://github.com/chumpage/chumpy-windows][chumpage/chumpy-windows]]                 | Move left/right/up/down through your windows                           |
| ergore                       | 2017-08-05 | [[https://github.com/jonnay/ergore][jonnay/ergore]]                           | Personal Bitlbee robot and helper                                      |
| pcb-mode                     | 2017-08-05 | [[https://github.com/rswarbrick/pcb-mode][rswarbrick/pcb-mode]]                     | Major mode providing a pcb mode hook for Emacs                         |
| cdecl                        | 2017-08-03 | [[https://github.com/jhgorrell/cdecl-el][jhgorrell/cdecl-el]]                      | Run cdecl                                                              |
| fscroll                      | 2017-08-03 | [[https://github.com/davep/fscroll.el][davep/fscroll.el]]                        | Make scroll-{up,down} go all the way                                   |
| constellations               | 2017-08-02 | [[https://github.com/davep/constellations.el][davep/constellations.el]]                 | Constellation tools                                                    |
| icmp-info                    | 2017-08-02 | [[https://github.com/davep/icmp-info.el][davep/icmp-info.el]]                      | ICMP information tool                                                  |
| ngn                          | 2017-08-02 | [[https://github.com/davep/ngn.el][davep/ngn.el]]                            | Quickly insert a newsgroup name                                        |
| nukneval                     | 2017-08-02 | [[https://github.com/davep/nukneval.el][davep/nukneval.el]]                       | Nuke and reevaluate an elisp buffer                                    |
| smartsig                     | 2017-08-02 | [[https://github.com/davep/smartsig.el][davep/smartsig.el]]                       | Smart signature selection based on message content                     |
| unbind                       | 2017-08-02 | [[https://github.com/davep/unbind.el][davep/unbind.el]]                         | Commands for unbinding things                                          |
| vc-partial-commit            | 2017-08-02 | [[https://github.com/fperrin/vc-partial-commit][fperrin/vc-partial-commit]]               | Commit only some changes from a diff                                   |
| binmove                      | 2017-07-29 | [[https://github.com/beketa/binmove][beketa/binmove]]                          | Minor mode to move cursor up / down like binary search                 |
| ido-better-flex              | 2017-07-29 | [[https://github.com/vic/ido-better-flex][vic/ido-better-flex]]                     | A better flex (fuzzy) algorithm for Ido                                |
| makefile-runner              | 2017-07-29 | [[https://github.com/danamlund/emacs-makefile-runner][danamlund/emacs-makefile-runner]]         | Searches for Makefile and fetches targets                              |
| crisp-mode                   | 2017-07-20 | [[https://github.com/krisajenkins/crisp-mode][krisajenkins/crisp-mode]]                 | Major mode for Crisp code                                              |
| clip2org                     | 2017-07-03 | [[https://github.com/thamer/clip2org][thamer/clip2org]]                         | Convert Kindle's My Clippings.txt into Org                             |
| thrift-mode                  | 2017-06-12 | [[https://github.com/davidmiller/thrift-mode][davidmiller/thrift-mode]]                 | Major mode for editing Thrift definition files                         |
| griffin                      | 2017-02-14 | [[https://github.com/tokenrove/griffin][tokenrove/griffin]]                       | A static blog generator à la Jekyll                                    |
| font-lock-regression-suite   | 2017-02-05 | [[https://github.com/Lindydancer/font-lock-regression-suite][Lindydancer/font-lock-regression-suite]]  | Test suite for font-lock                                               |
| backups-mode                 | 2017-01-28 | [[https://github.com/chadbraunduin/backups-mode][chadbraunduin/backups-mode]]              | Major mode for autosaving files and listing, viewing, and reverting Em |
| ido-other-window             | 2017-01-26 | [[https://github.com/timcharper/ido-other-window][timcharper/ido-other-window]]             | Invoke ido completion in other window                                  |
| window-margin                | 2016-12-18 | [[https://github.com/aculich/window-margin.el][aculich/window-margin.el]]                | Automatic margins for visual-line-mode wrapping                        |
| git-emacs                    | 2016-10-28 | [[https://github.com/tsgates/git-emacs][tsgates/git-emacs]]                       | Yet another git emacs mode for newbies                                 |
| package-demo                 | 2016-10-05 | [[https://github.com/vermiculus/package-demo][vermiculus/package-demo]]                 | Scripted emacs sessions                                                |
| maildir                      | 2016-08-14 | [[https://github.com/nicferrier/emacs-maildir][nicferrier/emacs-maildir]]                | A full maildir handling tool                                           |
| emacs-speaks-nonmem          | 2016-07-22 | [[https://github.com/mattfidler/Emacs-Speaks-NONMEM][mattfidler/Emacs-Speaks-NONMEM]]          | Starting Emacs Speaks NONMEM                                           |
| h2o                          | 2016-07-19 | [[https://github.com/punchagan/h2o][punchagan/h2o]]                           | Orgmode-formatted READMEs for your ELisp                               |
| org-manage                   | 2016-07-17 | [[https://github.com/dmgerman/org-manage][dmgerman/org-manage]]                     | Manage org files in a given directory                                  |
| docsetutil                   | 2016-07-07 | [[https://github.com/leoliu/docsetutil-el][leoliu/docsetutil-el]]                    | Use Cocoa/iOS documentations in emacs                                  |
| screensend                   | 2016-06-06 | [[https://github.com/benwbooth/screensend.el][benwbooth/screensend.el]]                 | Send blocks of text from emacs to screen or tmux sessions              |
| json-sexp-mode               | 2016-05-24 | [[https://github.com/TaylanUB/json-sexp-mode][TaylanUB/json-sexp-mode]]                 | Edit JSON in s-expression form                                         |
| org-helpers                  | 2016-03-26 | [[https://github.com/leoc/org-helpers.el][leoc/org-helpers.el]]                     | Summered for Emacs                                                     |
| zonokai-theme                | 2016-03-21 | [[https://github.com/ZehCnaS34/zonokai-emacs][ZehCnaS34/zonokai-emacs]]                 | Blue based theme for emacs                                             |
| eimap                        | 2016-02-22 | [[https://github.com/corecode/eimap][corecode/eimap]]                          | Imap processing using a streaming data model                           |
| pulseaudio                   | 2016-02-22 | [[https://github.com/suzp1984/pulseaudio-mode][suzp1984/pulseaudio-mode]]                | Pulseaudio control panel                                               |
| old-fashioned-undo           | 2016-02-21 | [[https://github.com/k-talo/old-fashioned-undo.el][k-talo/old-fashioned-undo.el]]            | Undo/Redo in very simple, and old fashioned way                        |
| mks                          | 2016-02-17 | [[https://github.com/sensorflo/mks][sensorflo/mks]]                           | Mks source interface for emacs                                         |
| rustfmt                      | 2016-02-17 | [[https://github.com/fbergroth/emacs-rustfmt][fbergroth/emacs-rustfmt]]                 | Format rust code using rustfmt                                         |
| smart-log                    | 2016-01-21 | [[https://github.com/mhayashi1120/smart-log.el][mhayashi1120/smart-log.el]]               | View log file mode with intepretting miscellaneous time format         |
| scrobble                     | 2016-01-18 | [[https://github.com/larsmagne/scrobble.el][larsmagne/scrobble.el]]                   | Interfacing with last.fm                                               |
| pmd                          | 2016-01-17 | [[https://github.com/pmd/pmd-emacs][pmd/pmd-emacs]]                           | Major mode for plugging PMD into Emacs                                 |
| stack-mode                   | 2016-01-11 | [[https://github.com/commercialhaskell/stack-ide][commercialhaskell/stack-ide]]             | A minor mode enabling various features based on stack-ide              |
| indirect-region              | 2016-01-04 | [[https://github.com/renard/indirect-region][renard/indirect-region]]                  | Act like indirect-buffer but for region                                |
| jb-misc-functions            | 2015-12-20 | [[https://github.com/vapniks/jb-misc-functions][vapniks/jb-misc-functions]]               | Miscellaneous functions for keymaps & other things                     |
| wmii                         | 2015-12-14 | [[https://github.com/fsmunoz/wmii-el][fsmunoz/wmii-el]]                         | Elisp controller for the wmii window-manager                           |
| mplayer-mode                 | 2015-12-12 | [[https://github.com/markhepburn/mplayer-mode][markhepburn/mplayer-mode]]                | Control mplayer, facilitating transcription and note-taking            |
| org-readme                   | 2015-12-04 | [[https://github.com/mattfidler/org-readme][mattfidler/org-readme]]                   | Integrates Readme.org and Commentary/Change-logs                       |
| auto-document                | 2015-12-03 | [[https://github.com/rubikitch/auto-document][rubikitch/auto-document]]                 | Automatic document generator of Emacs Lisp                             |
| bbcode                       | 2015-11-19 | [[https://github.com/sensorflo/bbcode][sensorflo/bbcode]]                        | A major-mode for editing bbcode                                        |
| ios-config-mode              | 2015-11-04 | [[https://github.com/nibrahim/IOS-config-mode][nibrahim/IOS-config-mode]]                | Edit Cisco IOS configuration files                                     |
| indent-hints-mode            | 2015-09-23 | [[https://github.com/mgalgs/indent-hints-mode][mgalgs/indent-hints-mode]]                | Get some hints about whether your buffer is                            |
| accelerate                   | 2015-09-02 | [[https://github.com/yagunov/accelerate.el][yagunov/accelerate.el]]                   | Pump numeric arg for auto-repeated interactive commands                |
| spinasm-mode                 | 2015-08-22 | [[https://github.com/segoh/spinasm-mode][segoh/spinasm-mode]]                      | Mode for editing SpinAsm code                                          |
| pgrok                        | 2015-08-05 | [[https://github.com/juri/pgrok][juri/pgrok]]                              | Project Grokking for Emacs                                             |
| html-fold                    | 2015-07-21 | [[https://github.com/ataka/html-fold][ataka/html-fold]]                         | Fold HTML elements                                                     |
| company-ess                  | 2015-06-27 | [[https://github.com/Lompik/company-ess][Lompik/company-ess]]                      | R/ess Completion Backend for company-mode                              |
| vim-modeline                 | 2015-06-22 | [[https://github.com/cinsk/emacs-vim-modeline][cinsk/emacs-vim-modeline]]                | Vim modeline support                                                   |
| mandoku-meta-kr              | 2015-06-18 | [[https://github.com/cwittern/KR][cwittern/KR]]                             | Metadata for the KR repository to be used by Mandoku                   |
| let-recur                    | 2015-06-08 | [[https://github.com/tali713/tail-call][tali713/tail-call]]                       | Simplified implementation of recur                                     |
| lispy-mnemonic               | 2015-05-06 | [[https://github.com/itsjeyd/lispy-mnemonic][itsjeyd/lispy-mnemonic]]                  | Mnemonic key bindings for Lispy                                        |
| cppref                       | 2015-04-28 | [[https://github.com/kentaro/emacs-cppref][kentaro/emacs-cppref]]                    | A Simple C++ Reference Viewer                                          |
| guess-style                  | 2015-04-21 | [[https://github.com/nschum/guess-style][nschum/guess-style]]                      | Automatic setting of code style variables                              |
| symbols-mode                 | 2015-04-06 | [[https://github.com/orontee/symbols-mode][orontee/symbols-mode]]                    | List symbols of object files                                           |
| atom                         | 2015-03-29 | [[https://github.com/fperrin/atom][fperrin/atom]]                            | Create an Atom feed                                                    |
| abel                         | 2015-03-19 | [[https://github.com/abo-abo/abel][abo-abo/abel]]                            | Abbrevs for Elisp                                                      |
| ajc-java-complete            | 2015-02-27 | [[https://github.com/emacs-java/auto-java-complete][emacs-java/auto-java-complete]]           | Auto Java Completion for GNU Emacs                                     |
| skinny                       | 2015-02-21 | [[https://github.com/nicferrier/skinny][nicferrier/skinny]]                       | A blog engine with elnode                                              |
| color-dired                  | 2015-02-20 | [[https://github.com/mhayashi1120/Emacs-color-dired][mhayashi1120/Emacs-color-dired]]          | Make colorize dired buffer by modified time                            |
| findwalker                   | 2015-02-20 | [[https://github.com/mhayashi1120/Emacs-findwalker][mhayashi1120/Emacs-findwalker]]           | Find file utilities                                                    |
| gosh-mode                    | 2015-02-09 | [[https://github.com/mhayashi1120/Emacs-gosh-mode][mhayashi1120/Emacs-gosh-mode]]            | Programming language gauche editing tools                              |
| skeleton-complete            | 2015-02-05 | [[https://github.com/baohaojun/skeleton-complete][baohaojun/skeleton-complete]]             | Dynamically expand expressions by provided skeleton (flex matching)    |
| eltex                        | 2015-01-23 | [[https://github.com/abo-abo/eltex][abo-abo/eltex]]                           | Write LaTeX in Emacs Lisp                                              |
| elisp-slime-expand           | 2015-01-14 | [[https://github.com/russell/elisp-slime-expand][russell/elisp-slime-expand]]              | A SLIME inspired expander for macros                                   |
| bundle                       | 2015-01-12 | [[https://github.com/tarao/bundle-el][tarao/bundle-el]]                         | An el-get wrapper                                                      |
| openssl-cipher               | 2015-01-11 | [[https://github.com/mhayashi1120/Emacs-openssl-cipher][mhayashi1120/Emacs-openssl-cipher]]       | Encrypt/Decrypt string with password by openssl                        |
| perlbrew-mini                | 2015-01-03 | [[https://github.com/dams/perlbrew-mini.el][dams/perlbrew-mini.el]]                   | A simple perlbrew wrapper for Emacs                                    |
| latex-wrap                   | 2015-01-02 | [[https://github.com/abo-abo/latex-wrap][abo-abo/latex-wrap]]                      | Wrap selection with a LaTeX environment                                |
| inertial-scroll              | 2014-12-20 | [[https://github.com/kiwanami/emacs-inertial-scroll][kiwanami/emacs-inertial-scroll]]          | Global minor mode for inertial scrolling                               |
| noprefix                     | 2014-12-14 | [[https://github.com/abo-abo/noprefix][abo-abo/noprefix]]                        | Strip/dress namespace prefix from Elisp package                        |
| kibit-mode                   | 2014-12-12 | [[https://github.com/aredington/kibit-mode][aredington/kibit-mode]]                   | Enhance clojure-mode with Kibit analysis                               |
| org-email                    | 2014-11-30 | [[https://github.com/nicferrier/org-email][nicferrier/org-email]]                    | Use org for an email database                                          |
| better-jump                  | 2014-11-24 | [[https://github.com/Fuco1/better-jump][Fuco1/better-jump]]                       | Execute actions at places                                              |
| door-gnus                    | 2014-10-27 | [[https://github.com/yyr/door-gnus][yyr/door-gnus]]                           | Hack to enter, bury, unbury gnus                                       |
| wikidoc                      | 2014-10-25 | [[https://github.com/nicferrier/elwikidoc][nicferrier/elwikidoc]]                    | Use elisp doc strings to make other documentation                      |
| one-key                      | 2014-10-23 | [[https://github.com/vapniks/one-key][vapniks/one-key]]                         | Easy access configurable popup menus to display keybindings and other  |
| namelist-mode                | 2014-10-21 | [[https://github.com/yyr/namelist-mode][yyr/namelist-mode]]                       | Major Mode for editing f90 namelist files                              |
| gnus-identities              | 2014-10-03 | [[https://github.com/renard/gnus-identities][renard/gnus-identities]]                  | Change identity when composing a message                               |
| dired-sync                   | 2014-09-30 | [[https://github.com/renard/dired-sync][renard/dired-sync]]                       | Sync directories within dired                                          |
| lyricwiki                    | 2014-09-28 | [[https://github.com/febuiles/lyricwiki.el][febuiles/lyricwiki.el]]                   | An Emacs mode to fetch lyrics                                          |
| ert-buffer-report            | 2014-09-21 | [[https://github.com/tj64/ert-buffer-report][tj64/ert-buffer-report]]                  | Extensions for ert-buffer.el                                           |
| ecd                          | 2014-09-16 | [[https://github.com/akicho8/ecd][akicho8/ecd]]                             | Easy Change Directory                                                  |
| mail-bug                     | 2014-07-27 | [[https://github.com/xaccrocheur/mail-bug][yPhil-gh/mail-bug]]                       | A purely IMAP based email client for EMACS                             |
| a2ps-multibyte               | 2014-07-16 | [[https://github.com/ffevotte/a2ps-multibyte.el][ffevotte/a2ps-multibyte.el]]              | Print buffers with a2ps even when they are encoded in utf-8            |
| go-svg                       | 2014-07-06 | [[https://github.com/yhvh/go-svg-mode][yhvh/go-svg-mode]]                        | A go gtp interface with svg image support                              |
| shoes-off                    | 2014-06-29 | [[https://github.com/nicferrier/shoes-off][nicferrier/shoes-off]]                    | Irc bouncer                                                            |
| less                         | 2014-06-12 | [[https://github.com/xwl/less][xwl/less]]                                | Less style view mode                                                   |
| highlight-sexp               | 2014-06-11 | [[https://github.com/daimrod/highlight-sexp][daimrod/highlight-sexp]]                  | Highlight current zone according to its context                        |
| smart-quotes                 | 2014-06-10 | [[https://github.com/gareth-rees/smart-quotes][gareth-rees/smart-quotes]]                | Smart Quotes minor mode for GNU Emacs                                  |
| todostack                    | 2014-05-18 | [[https://github.com/EvansWinner/todostack.el][EvansWinner/todostack.el]]                | Keep a to-do list as a simple stack                                    |
| buffer-timer                 | 2014-05-09 | [[https://github.com/hardaker/elisp-buffer-timer][hardaker/elisp-buffer-timer]]             | Track your time based on the buffers you edit                          |
| try-code                     | 2014-05-05 | [[https://github.com/lewang/try-code][lewang/try-code]]                         | Try out a new idea by commenting out old code                          |
| eviews                       | 2014-05-03 | [[https://github.com/vapniks/eviews-mode][vapniks/eviews-mode]]                     | Major-mode for editing eviews program files                            |
| org-hlc                      | 2014-04-17 | [[https://github.com/tj64/org-hlc][tj64/org-hlc]]                            | Hidden-lines-cookies for folded Org-mode headlines                     |
| html5                        | 2014-04-16 | [[https://github.com/hober/html5-el][hober/html5-el]]                          | Named Character References in HTML5                                    |
| org-watchdoc                 | 2014-04-10 | [[https://github.com/tj64/org-watchdoc][tj64/org-watchdoc]]                       | Watchdog for exported Org-mode trees                                   |
| im-notification              | 2014-03-21 | [[https://github.com/bvtrach/emacs-im-notification][bvtrach/emacs-im-notification]]           | Emacs input method notification via D-Bus                              |
| drill-instructor             | 2014-03-07 | [[https://github.com/k1LoW/emacs-drill-instructor][k1LoW/emacs-drill-instructor]]            | Enforce key-bind of Emacs                                              |
| terminal-notifier            | 2014-02-17 | [[https://github.com/krismolendyke/terminal-notifier.el][krismolendyke/terminal-notifier.el]]      | OS X Notification Center messages                                      |
| helm-find-files-in-project   | 2014-02-07 | [[https://github.com/tototoshi/helm-find-files-in-project][tototoshi/helm-find-files-in-project]]    | Find files in project from helm                                        |
| mailq                        | 2013-12-30 | [[https://github.com/dimitri/mailq-el][dimitri/mailq-el]]                        | A major mode for `mailq' interaction                                   |
| osm-mode                     | 2013-12-29 | [[https://github.com/ruediger/osm-mode][ruediger/osm-mode]]                       | OpenStreetMap (OSM) support for Emacs                                  |
| firefox-remote               | 2013-12-28 | [[https://github.com/ruediger/emacs-firefox-remote][ruediger/emacs-firefox-remote]]           | Support for Firefox' remote debugging protocol ;;                      |
| theme-park-mode              | 2013-12-10 | [[https://github.com/darrik/theme-park-mode][darrik/theme-park-mode]]                  | Take your themes for a ride!                                           |
| ca2+                         | 2013-12-09 | [[https://github.com/hjanetzek/ca2][hjanetzek/ca2]]                           | An improved fork of `company-mode'                                     |
| comicscript                  | 2013-11-26 | [[https://github.com/jkersey/comicscript][jkersey/comicscript]]                     | A major mode for editing comic script files                            |
| picolisp-wiki-mode           | 2013-11-07 | [[https://github.com/tj64/picolisp-wiki-mode][tj64/picolisp-wiki-mode]]                 | Emacs Major mode for PicoLisp-Wiki formatted text files                |
| inform-mode                  | 2013-10-10 | [[https://github.com/rupertl/inform-mode][rupertl/inform-mode]]                     | Major mode for Inform 6 interactive fiction code                       |
| org-reading                  | 2013-10-01 | [[https://github.com/abhiyerra/org-reading][abhiyerra/org-reading]]                   | Manage your reading with org-mode                                      |
| mu                           | 2013-09-19 | [[https://github.com/kensanata/mu][kensanata/mu]]                            | Play on a MUSH or MUD within Emacs                                     |
| one-key-local                | 2013-08-30 | [[https://github.com/aki2o/one-key-local][aki2o/one-key-local]]                     | Create menu of one-key.el for any major-mode or minor-mode             |
| startupd                     | 2013-08-24 | [[https://github.com/fgallina/startupd.el][fgallina/startupd.el]]                    | Modular loading of Emacs configuration                                 |
| ical-event                   | 2013-08-23 | [[https://github.com/jtatarik/ical-event][jtatarik/ical-event]]                     | ICalendar Event Object                                                 |
| jamar                        | 2013-08-17 | [[https://github.com/kliph/jamar-el][kliph/jamar-el]]                          | What's the math?                                                       |
| show-marks                   | 2013-08-05 | [[https://github.com/vapniks/show-marks][vapniks/show-marks]]                      | Navigate and visualize the mark-ring                                   |
| inf-ruby-bond                | 2013-07-17 | [[https://github.com/pd/inf-ruby-bond][pd/inf-ruby-bond]]                        | Bond autocompletion support for inf-ruby                               |
| db-sql                       | 2013-06-27 | [[https://github.com/renard/db-sql-el][renard/db-sql-el]]                        | Connect to SQL server using tramp syntax                               |
| ant-project-mode             | 2013-06-26 | [[https://github.com/skeeto/ant-project-mode][skeeto/ant-project-mode]]                 | Minor mode supporting Apache Ant projects                              |
| generic-edit-special         | 2013-06-09 | [[https://github.com/lewang/generic-edit-special][lewang/generic-edit-special]]             | Editing submodes html css javascript                                   |
| tags-view                    | 2013-06-04 | [[https://github.com/markhepburn/tags-view][markhepburn/tags-view]]                   | Display and navigate tags browsing history                             |
| rcfiles                      | 2013-06-03 | [[https://github.com/didierverna/el-rcfiles][didierverna/el-rcfiles]]                  | Unix-like rc files for Emacs Lisp libraries                            |
| nreplxmp                     | 2013-06-02 | [[https://github.com/wakala/nreplxmp][wakala/nreplxmp]]                         | Lispxmp porting for clojure nrepl                                      |
| org-nan                      | 2013-05-28 | [[https://github.com/gkappler/org-nan][gkappler/org-nan]]                        | Narrowing to multiple subtrees for Org-mode entries                    |
| current-story                | 2013-05-24 | [[https://github.com/charlietanksley/current-story][charlietanksley/current-story]]           | Track and insert current Pivotal Tracker                               |
| fullscreen-mode              | 2013-05-24 | [[https://github.com/ryantm/fullscreen-mode][ryantm/fullscreen-mode]]                  | Fullscreen window support for Emacs                                    |
| owl-functional-mode          | 2013-05-17 | [[https://github.com/vakkermans/owl-functional-mode][vakkermans/owl-functional-mode]]          | Simple Emacs major mode for the OWL functional syntax                  |
| ngircd                       | 2013-05-16 | [[https://github.com/nicferrier/emacs-ngircd][nicferrier/emacs-ngircd]]                 | Start ngircd servers from emacs                                        |
| erc-babel                    | 2013-05-13 | [[https://github.com/vapniks/erc-babel][vapniks/erc-babel]]                       | Communicate with ERC in different languages using online translation s |
| spss                         | 2013-05-13 | [[https://github.com/vapniks/spss-mode][vapniks/spss-mode]]                       | Major-mode for editing SPSS program files                              |
| colour-region                | 2013-05-11 | [[https://github.com/vapniks/colour-region][vapniks/colour-region]]                   | Toggle regions of the buffer with different text snippets              |
| helm-mu-contacts             | 2013-05-10 | [[https://github.com/agpchil/helm-mu-contacts][agpchil/helm-mu-contacts]]                | Mu contacts source for helm                                            |
| simplegv-mode                | 2013-05-05 | [[https://github.com/jordonbiondo/simplegv-mode][jordonbiondo/simplegv-mode]]              | Editing mode of JLSCircuitTester files                                 |
| nnir-spotlight               | 2013-05-03 | [[https://github.com/renard/nnir-spotlight][renard/nnir-spotlight]]                   | Use MacOSX sportlight as nnir backend                                  |
| rb                           | 2013-05-02 | [[https://github.com/nicferrier/emacs-rhythmbox][nicferrier/emacs-rhythmbox]]              | Control rhythmbox from emacs                                           |
| rubyinterpol                 | 2013-04-28 | [[https://github.com/ober/rubyinterpol][ober/rubyinterpol]]                       | Ruby-like String Interpolation for format                              |
| includeme                    | 2013-04-22 | [[https://github.com/jart/includeme][jart/includeme]]                          | Auto C/C++ '#include' and 'using' in Emacs                             |
| huskie                       | 2013-04-17 | [[https://github.com/nicferrier/emacs-huskie][nicferrier/emacs-huskie]]                 | Chainsaw powered logging                                               |
| transcript                   | 2013-04-17 | [[https://github.com/natfarleydev/transcript-el][natfarleydev/transcript-el]]              | Edit transcripts of sound recordings                                   |
| ertorrent                    | 2013-04-08 | [[https://github.com/spacebat/ertorrent][spacebat/ertorrent]]                      | An rtorrent xml-rpc interface and ui                                   |
| xrc                          | 2013-04-07 | [[https://github.com/spacebat/xrc][spacebat/xrc]]                            | Syntax sugar and other goodies for working with xml-rpc.el             |
| bd-set-mark                  | 2013-04-01 | [[https://github.com/lewang/bd-set-mark][lewang/bd-set-mark]]                      | Allow forward movement in mark-ring                                    |
| node-console                 | 2013-04-01 | [[https://github.com/yuutayamada/node-console][yuutayamada/node-console]]                | Execute javascript by node.js from Emacs                               |
| swarmhacker                  | 2013-04-01 | [[https://github.com/nicferrier/emacs-swarmhacker][nicferrier/emacs-swarmhacker]]            | Simple swarm chat                                                      |
| async-eval                   | 2013-03-28 | [[https://github.com/nschum/async-eval.el][nschum/async-eval.el]]                    | Execute Emacs lisp in a separate process                               |
| lisp-editing                 | 2013-03-13 | [[https://github.com/nicferrier/emacs-lisp-editing-tools][nicferrier/emacs-lisp-editing-tools]]     | Lisp editing tools                                                     |
| isea                         | 2013-03-10 | [[https://github.com/nicferrier/emacs-isea][nicferrier/emacs-isea]]                   | Interactive server eval at mode, a comint for a daemonized emacs       |
| masquerade-mode              | 2013-03-08 | [[https://github.com/dsevilla/masquerade-mode-el][dsevilla/masquerade-mode-el]]             | Minor mode to add templating capabilities to any mode                  |
| pry                          | 2013-03-08 | [[https://github.com/jacott/emacs-pry][jacott/emacs-pry]]                        | Interaction with the ruby pry command                                  |
| auto-complete-clang-objc     | 2013-03-04 | [[https://github.com/tharpa/auto-complete-clang-objc][tharpa/auto-complete-clang-objc]]         | Auto Completion source for clang for GNU Emacs                         |
| keyadvice                    | 2013-03-04 | [[https://github.com/Fuco1/keyadvice.el][Fuco1/keyadvice.el]]                      | Advice keybindings to run additional user defined code                 |
| twiki                        | 2013-03-04 | [[https://github.com/christopherjwhite/emacs-twiki-mode][christopherjwhite/emacs-twiki-mode]]      | Mode for editing Twiki wiki files for emacs                            |
| wipe                         | 2013-03-04 | [[https://github.com/didierverna/wipe][didierverna/wipe]]                        | Whitespace Inspection and Pruning for Emacs                            |
| evil-elscreen                | 2013-03-03 | [[https://github.com/coldnew/evil-elscreen][coldnew/evil-elscreen]]                   | Evil wrpaaer to use elscreen as tab                                    |
| ne2wm                        | 2013-02-27 | [[https://github.com/tkf/ne2wm][tkf/ne2wm]]                               | Load all plugin/perspectives in ne2wm                                  |
| dvorak-mode                  | 2013-02-24 | [[https://github.com/traveter/dvorak-mode][traveter/dvorak-mode]]                    | Minor mode for convert qwerty input to dvorak input                    |
| elpad-client                 | 2013-02-24 | [[https://github.com/nicferrier/elpad-client][nicferrier/elpad-client]]                 | A client for elpad                                                     |
| rcirc-ssh                    | 2013-02-24 | [[https://github.com/nicferrier/rcirc-ssh-sessions][nicferrier/rcirc-ssh-sessions]]           | Do irc over ssh sessions                                               |
| ebm                          | 2013-02-19 | [[https://github.com/carrl/ebm][carrl/ebm]]                               | Emacs Bookmarks                                                        |
| indicate-changes             | 2013-02-19 | [[https://github.com/renard/indicate-change][renard/indicate-change]]                  | Indicate buffer modifications in fringe                                |
| save-packages                | 2013-02-19 | [[https://github.com/petere/emacs-save-packages][petere/emacs-save-packages]]              | Save and restore installed packages                                    |
| org-presie                   | 2013-02-18 | [[https://github.com/nicferrier/org-presie][nicferrier/org-presie]]                   | Simple presentation with an org file                                   |
| csmart-mode                  | 2013-02-17 | [[https://github.com/kwitek/csmart][krzsztf/csmart]]                          | C# minor mode for .Net/Mono context                                    |
| kindly-mode                  | 2013-02-16 | [[https://github.com/fukamachi/kindly-mode][fukamachi/kindly-mode]]                   | Amazon Kindle-like view mode                                           |
| orgrade                      | 2013-02-13 | [[https://github.com/gucong/emacs-orgrade][gucong/emacs-orgrade]]                    | Grade book built upon orgtbl that accelerates input                    |
| paste                        | 2013-02-13 | [[https://github.com/nicferrier/pasteel][nicferrier/pasteel]]                      | Paste server with elnode                                               |
| noob-arrows-mode             | 2013-02-12 | [[https://github.com/n3mo/noob-arrows-mode.el][n3mo/noob-arrows-mode.el]]                | Noob arrows minor mode                                                 |
| helm-google-contacts         | 2013-02-10 | [[https://github.com/yuutayamada/helm-google-contacts][yuutayamada/helm-google-contacts]]        | Search google contacts list by helm                                    |
| sequence                     | 2013-02-07 | [[https://github.com/nicferrier/emacs-sequence][nicferrier/emacs-sequence]]               | Makes sequences of numbers                                             |
| twiki-org                    | 2013-02-06 | [[https://github.com/saintaardvark/twiki-org][saintaardvark/twiki-org]]                 | Major mode for editing twiki documents                                 |
| etags-update                 | 2013-02-04 | [[https://github.com/mattkeller/etags-update][mattkeller/etags-update]]                 | Update TAGS when saving a file                                         |
| gtags                        | 2013-02-03 | [[https://github.com/leoliu/gtags-el][leoliu/gtags-el]]                         | Gtags facility for Emacs                                               |
| ssl-mode                     | 2013-01-31 | [[https://github.com/npc3/ssl-mode][npc3/ssl-mode]]                           | Emacs Major mode for S/SL files                                        |
| tbemail                      | 2013-01-31 | [[https://github.com/martinp26/tbemail][martinp26/tbemail]]                       | Provide syntax highlighting for email editing via                      |
| edbc                         | 2013-01-22 | [[https://github.com/redraiment/edbc][redraiment/edbc]]                         | Emacs database access technology                                       |
| recaptcha                    | 2013-01-20 | [[https://github.com/fsmunoz/recaptcha][fsmunoz/recaptcha]]                       | An Emacs Lisp interface to reCAPTCHA                                   |
| doxygen                      | 2013-01-19 | [[https://github.com/TreeRex/doxygen-el][TreeRex/doxygen-el]]                      | Support for doxygen style comments                                     |
| wordpress-mode               | 2013-01-19 | [[https://github.com/danlamanna/wordpress-mode][danlamanna/wordpress-mode]]               | A minor mode for speeding up WordPress development in emacs            |
| revealjs-mode                | 2013-01-14 | [[https://github.com/cjohansen/revealjs-mode][cjohansen/revealjs-mode]]                 | Minor mode to navigate and edit HTML files                             |
| ant-mode                     | 2013-01-13 | [[https://github.com/tkg/ant-mode][tkg/ant-mode]]                            | Mode for Ant build files                                               |
| buftoggle                    | 2013-01-11 | [[https://github.com/michaelw/buftoggle][michaelw/buftoggle]]                      | Toggles between related buffers and files                              |
| helm-project                 | 2013-01-11 | [[https://github.com/shishi/helm-project][shishi/helm-project]]                     | Finding any resource of a project                                      |
| dired-xattr                  | 2013-01-10 | [[https://github.com/renard/dired-xattr][renard/dired-xattr]]                      | Handle MacOSX Finder color label in dired                              |
| quick-jump                   | 2013-01-10 | [[https://github.com/jixiuf/quick-jump][jixiuf/quick-jump]]                       | Remember current position,and jump back                                |
| delim-pad                    | 2013-01-05 | [[https://github.com/lewang/delim-pad][lewang/delim-pad]]                        | Control space padding around delimiters                                |
| gaplay                       | 2013-01-04 | [[https://github.com/te223/gaplay-el][te223/gaplay-el]]                         | An audio player for GNU Emacs                                          |
| worklog                      | 2013-01-03 | [[https://github.com/credmp/worklog][credmp/worklog]]                          | The Emacs timetracker                                                  |
| opscode-sign                 | 2012-12-22 | [[https://github.com/skeptomai/opscode-emacs-sign][skeptomai/opscode-emacs-sign]]            | Opscode API request signer                                             |
| slate-config-mode            | 2012-12-18 | [[https://github.com/ddjfreedom/slate-config-mode][ddjfreedom/slate-config-mode]]            | A major mode to edit .slate file to config Slate window manager        |
| grr                          | 2012-12-17 | [[https://github.com/leathekd/grr.el][leathekd/grr.el]]                         | Simple Growl notifications for Emacs and Mac OS X                      |
| wmctrl                       | 2012-12-16 | [[https://github.com/tkf/emacs-wmctrl][tkf/emacs-wmctrl]]                        | Control X Window Manager from Emacs                                    |
| kindle-mode                  | 2012-12-13 | [[https://github.com/kototama/kindle-mode][kototama/kindle-mode]]                    | A minor mode for the Kindle 'My Clippings.txt' file                    |
| diatheke                     | 2012-12-11 | [[https://github.com/JasonFruit/diatheke.el][JasonFruit/diatheke.el]]                  | A minor mode using the diatheke command-line Bible tool                |
| snort-mode                   | 2012-12-06 | [[https://github.com/BobuSumisu/snort-mode][BobuSumisu/snort-mode]]                   | Major mode for editing Snort rules                                     |
| yeoman                       | 2012-12-03 | [[https://github.com/julienXX/yeoman.el][julienXX/yeoman.el]]                      | Interact with Yeoman from Emacs                                        |
| auto-pep8                    | 2012-12-02 | [[https://github.com/deactivated/auto-pep8.el][deactivated/auto-pep8.el]]                | Minor mode to automatically run pep8 on save                           |
| cdmi-mode                    | 2012-11-30 | [[https://github.com/jeastman/cdmi-mode][jeastman/cdmi-mode]]                      | An emacs mode for working with CDMI data                               |
| sofa                         | 2012-11-30 | [[https://github.com/cinsk/emacs-sofa][cinsk/emacs-sofa]]                        | CouchDB console (like Futon)                                           |
| codethumb                    | 2012-11-23 | [[https://github.com/tkf/emacs-codethumb][tkf/emacs-codethumb]]                     | Show code thumbnail                                                    |
| gnus-est                     | 2012-11-18 | [[https://github.com/kawabata/gnus-est][kawabata/gnus-est]]                       | Search mail with HyperEstraier                                         |
| darken-text                  | 2012-11-16 | [[https://github.com/renard/darken-text][renard/darken-text]]                      | Darken font-faced text in emacs                                        |
| mew-unread                   | 2012-11-14 | [[https://github.com/tortkis/mew-unread][tortkis/mew-unread]]                      | Folder list mode for mew                                               |
| trelloel                     | 2012-11-12 | [[https://github.com/jdodds/trelloel][jdodds/trelloel]]                         | Communication layer for the Trello API                                 |
| osxpkg                       | 2012-10-30 | [[https://github.com/renard/osxpkg][renard/osxpkg]]                           | Manage Mac OSX packages                                                |
| csp-mode                     | 2012-10-29 | [[https://github.com/zonix/csp-mode][zonix/csp-mode]]                          | Major mode for editing CSP specification in Emacs                      |
| theme-helper                 | 2012-10-28 | [[https://github.com/lewang/theme-helper][lewang/theme-helper]]                     | Create color themes faster                                             |
| ac-dscanner                  | 2012-10-21 | [[https://github.com/jmaschme/ac-dscanner][jmaschme/ac-dscanner]]                    | Auto Completion source for dscanner for GNU Emacs                      |
| multi-column-mode            | 2012-10-21 | [[https://github.com/diiq/multi-column-mode][diiq/multi-column-mode]]                  | Multi-column editing                                                   |
| ogi                          | 2012-10-20 | [[https://github.com/ryuslash/ogi][ryuslash/ogi]]                            | Github issues in org-mode                                              |
| clasker                      | 2012-10-18 | [[https://github.com/clasker/clasker][clasker/clasker]]                         | An experimental tracker for Emacs                                      |
| helm-build-command           | 2012-10-15 | [[https://github.com/tkf/helm-build-command][tkf/helm-build-command]]                  | Helm/anything interface for build commands                             |
| rcirc-robots                 | 2012-10-15 | [[https://github.com/nicferrier/rcirc-robots][nicferrier/rcirc-robots]]                 | Robots based on rcirc irc                                              |
| octopress-tentacle           | 2012-10-13 | [[https://github.com/brighid/octopress-tentacle][brighid/octopress-tentacle]]              | Tools for Octopress/Jekyll blogs                                       |
| songbook                     | 2012-09-19 | [[https://github.com/crep4ever/songbook-emacs-mode][crep4ever/songbook-emacs-mode]]           | Major mode for editing the song files of Patacrep songbook             |
| gplus-mode                   | 2012-09-06 | [[https://github.com/ellencubed/gplus-mode][ellencubed/gplus-mode]]                   | Major mode for Google Plus                                             |
| evimodeline                  | 2012-08-31 | [[https://github.com/danderson/evimodeline][danderson/evimodeline]]                   | Vim modeline support                                                   |
| keyboard-converter           | 2012-08-20 | [[https://github.com/renard/keyboard-converter][renard/keyboard-converter]]               | Convert string from keyboard layouts                                   |
| open-related-file            | 2012-08-20 | [[https://github.com/skirino/open-related-file][skirino/open-related-file]]               | Open file related to the currently-opened file                         |
| edice                        | 2012-08-16 | [[https://github.com/capitaomorte/edice][joaotavora/edice]]                        | Really, why would you want to roll dice in Emacs?                      |
| sbt                          | 2012-08-15 | [[https://github.com/dchenbecker/sbt.el][dchenbecker/sbt.el]]                      | Support for running sbt in inferior mode                               |
| xargs-grep                   | 2012-08-12 | [[https://github.com/lewang/le_emacs_xargs_grep][lewang/le_emacs_xargs_grep]]              | Grep large sets of files by using xargs                                |
| lazy-search                  | 2012-08-08 | [[https://github.com/vapniks/lazy-search][vapniks/lazy-search]]                     | Lazy Search                                                            |
| moneylog                     | 2012-08-06 | [[https://github.com/watter/moneylog-el][watter/moneylog-el]]                      | Provide a way to enter moneylog logs                                   |
| package-store                | 2012-08-05 | [[https://github.com/nicferrier/emacs-package-store][nicferrier/emacs-package-store]]          | A package cache                                                        |
| org-bom                      | 2012-08-02 | [[https://github.com/Frozenlock/Org-Bill-of-materials][Frozenlock/Org-Bill-of-materials]]        | Collect components across the entire org buffer                        |
| bing-api                     | 2012-07-30 | [[https://github.com/coordinate/bingapiel][coordinate/bingapiel]]                    | Use bing api                                                           |
| lagn                         | 2012-07-29 | [[https://github.com/vanicat/lagn][vanicat/lagn]]                            | A music player for Emacs that uses xmms2 as its backend                |
| diff-ediff                   | 2012-07-22 | [[https://github.com/matthewlmcclure/diff-ediff][matthewlmcclure/diff-ediff]]              | Navigate diff files with Ediff                                         |
| terrible-template            | 2012-07-22 | [[https://github.com/yonkeltron/terrible-template][yonkeltron/terrible-template]]            | Templates that don't suck, just terrible                               |
| mew-ical                     | 2012-07-17 | [[https://github.com/tagoh/mew-ical][tagoh/mew-ical]]                          | ICalendar support for Mew                                              |
| edit-thing                   | 2012-07-14 | [[https://github.com/deactivated/edit-thing-el][deactivated/edit-thing-el]]               | Narrow-to-region on steroids                                           |
| el-index                     | 2012-07-11 | [[https://github.com/medikoo/el-index][medikoo/el-index]]                        | Generic index mode for Emacs                                           |
| gradle                       | 2012-07-09 | [[https://github.com/vhallac/gradle-el][vhallac/gradle-el]]                       | Run gradle from emacs                                                  |
| atoctx                       | 2012-06-27 | [[https://github.com/quantumkid/atoctx][quantumkid/atoctx]]                       | Converts some LaTeX syntax to ConTeXt                                  |
| bookem                       | 2012-06-27 | [[https://github.com/kjfletch/bookem-el][kjfletch/bookem-el]]                      | Bookmark system organising bookmarks into groups                       |
| evelnote                     | 2012-06-17 | [[https://github.com/hadashiA/evelnote-for-evernote][hadashiA/evelnote-for-evernote]]          | Sync evernote note with emacs buffer                                   |
| puppet-pi-mode               | 2012-06-12 | [[https://github.com/t9md/puppet-pi-mode.el][t9md/puppet-pi-mode.el]]                  | Interface to puppet commandline tool pi                                |
| simple-slides                | 2012-06-12 | [[https://github.com/joodie/emacs-simple-slides][joodie/emacs-simple-slides]]              | Show page-break (^L) separated files as slides                         |
| slime-complete-locals        | 2012-06-12 | [[https://github.com/joodie/slime-complete-locals][joodie/slime-complete-locals]]            | Complete functions taking locally mentioned symbols into account       |
| org-status                   | 2012-06-07 | [[https://github.com/neil-smithline-elisp/org-status][neil-smithline-elisp/org-status]]         | Tweet using `org-mode's capture functionality                          |
| assert-rtn                   | 2012-05-30 | [[https://github.com/neil-smithline-elisp/assert-rtn][neil-smithline-elisp/assert-rtn]]         | A more functional implementation of `assert'                           |
| defhook                      | 2012-05-30 | [[https://github.com/neil-smithline-elisp/defhook][neil-smithline-elisp/defhook]]            | Declare hook functionality rather dynamically implementing it          |
| linum-ace                    | 2012-05-30 | [[https://github.com/coldnew/linum-ace][coldnew/linum-ace]]                       | Display line number as character like ace-jump-line-mode               |
| tumblr-mode                  | 2012-05-30 | [[https://github.com/qxj/tumblr-mode][qxj/tumblr-mode]]                         | Major mode for Tumblr                                                  |
| aml-mode                     | 2012-05-24 | [[https://github.com/david-christiansen/aml-mode][david-christiansen/aml-mode]]             | An Emacs major mode for AML                                            |
| curl                         | 2012-05-23 | [[https://github.com/cinsk/emacs-curl][cinsk/emacs-curl]]                        | CURL binding for elisp                                                 |
| linum-relativenumber         | 2012-05-07 | [[https://github.com/scottjad/linum-relativenumber][scottjad/linum-relativenumber]]           | Add relative line numbers to linum                                     |
| ssh-config                   | 2012-05-02 | [[https://github.com/renard/ssh-config-el][renard/ssh-config-el]]                    | Manage both ssh and dsh confguration from emacs                        |
| s3                           | 2012-04-30 | [[https://github.com/thorstadt/s3.el][ryancrum/s3.el]]                          | Interact with Amazon Web Services S3                                   |
| cheat                        | 2012-04-29 | [[https://github.com/samsonjs/cheat.el][samsonjs/cheat.el]]                       | A handy interface to the command line utility cheat                    |
| phantomjs                    | 2012-04-27 | [[https://github.com/nicferrier/phantomjsel][nicferrier/phantomjsel]]                  | Handle phantomjs                                                       |
| flymake-csslint              | 2012-04-25 | [[https://github.com/arnested/flymake-csslint][arnested/flymake-csslint]]                | Making flymake work with CSSLint                                       |
| kappa                        | 2012-04-23 | [[https://github.com/rhz/kappa-emacs][rhz/kappa-emacs]]                         | Major mode for Kappa models                                            |
| review                       | 2012-04-17 | [[https://github.com/gigamonkey/review][gigamonkey/review]]                       | Commands for inserting review comments                                 |
| css-format                   | 2012-04-16 | [[https://github.com/chalmagean/css-format.el][chalmagean/css-format.el]]                | Toggle CSS inline/multiline block format                               |
| org-global-insert-link       | 2012-04-15 | [[https://github.com/Neil-Smithline/org-global-insert-link][Neil-Smithline/org-global-insert-link]]   | Use Org Mode's ability to capture links in other modes                 |
| utf8islove                   | 2012-04-11 | [[https://github.com/robsimmons/utf8islove][robsimmons/utf8islove]]                   | Quail package for TeX integration                                      |
| avmmf                        | 2012-04-09 | [[https://github.com/davep/avmmf.el][davep/avmmf.el]]                          | AVM Microformat tools for emacs                                        |
| es                           | 2012-04-07 | [[https://github.com/leathekd/es.el][leathekd/es.el]]                          | An elasticsearch client for Emacs                                      |
| mru-yank                     | 2012-04-04 | [[https://github.com/lewang/le_emacs_MRU_yank][lewang/le_emacs_MRU_yank]]                | Most Recently Used stacking for kill-ring                              |
| org-defprop                  | 2012-03-12 | [[https://github.com/Neil-Smithline/org-defprop][Neil-Smithline/org-defprop]]              | Define Org Mode variables and settings with a corresponding #+KEYWORDS |
| auto-complete-golang         | 2012-03-02 | [[https://github.com/koko1000ban/auto-complete-golang][koko1000ban/auto-complete-golang]]        | Auto-complete.el source for golang                                     |
| numwin                       | 2012-03-01 | [[https://github.com/ruricolist/numwin][ruricolist/numwin]]                       | Generalized window numbering for Emacs                                 |
| grc                          | 2012-02-28 | [[https://github.com/leathekd/grc][leathekd/grc]]                            | Google Reader Mode for Emacs                                           |
| org-buffers                  | 2012-02-25 | [[https://github.com/dandavison/org-buffers][dandavison/org-buffers]]                  | An Org-mode tool for buffer management                                 |
| fuzzy-find-in-project        | 2012-02-21 | [[https://github.com/justinweiss/fuzzy-find-in-project][justinweiss/fuzzy-find-in-project]]       | Emacs binding to the `fuzzy_file_finder' rubygem                       |
| slime-js                     | 2012-02-21 | [[https://github.com/Gozala/slime-js][Gozala/slime-js]]                         | Slime extension for swank-js                                           |
| multiple-line-edit           | 2012-02-19 | [[https://github.com/k-talo/multiple-line-edit.el][k-talo/multiple-line-edit.el]]            | Edit multiple line at a time                                           |
| ob-markdown                  | 2012-02-12 | [[https://github.com/tnoda/ob-markdown][tnoda/ob-markdown]]                       | Org-babel functions for markdown evaluation                            |
| ii-mode                      | 2012-02-09 | [[https://github.com/krl/ii-mode][krl/ii-mode]]                             | Handle files created by irc client ii                                  |
| ac-r                         | 2012-02-08 | [[https://github.com/mattfidler/ac-R][mattfidler/ac-R]]                         | Autocompletion routines for R                                          |
| nazna                        | 2012-02-01 | [[https://github.com/baron/nazna.el][baron/nazna.el]]                          | Mental arithmetic for emacs                                            |
| activator                    | 2012-01-31 | [[https://github.com/apg/activator-el][apg/activator-el]]                        | An init.d style config manager                                         |
| switch-files                 | 2012-01-31 | [[https://github.com/hardaker/elisp-switch-files][hardaker/elisp-switch-files]]             | Switch between matched pairs of files and follow include directives    |
| cheat-fu                     | 2012-01-29 | [[https://github.com/jpablobr/cheat-fu-mode][jpablobr/cheat-fu-mode]]                  | An interface to the cheat-fu service                                   |
| sourcepawn-mode              | 2012-01-28 | [[https://github.com/agrif/sourcepawn-mode][agrif/sourcepawn-mode]]                   | SourcePawn major mode for emacs                                        |
| whole-line-funcs             | 2012-01-28 | [[https://github.com/lewang/le_emacs_whole_line_funcs][lewang/le_emacs_whole_line_funcs]]        | Triple-click like line marking functions                               |
| xdg-paths                    | 2012-01-28 | [[https://github.com/tomprince/xdg-paths-el][tomprince/xdg-paths-el]]                  | XDG Base Directory Specification paths for emacs                       |
| parfait-mode                 | 2012-01-23 | [[https://github.com/sorellabs/parfait-mode][sorellabs/parfait-mode]]                  | Prettifies your code by removing needless clutter                      |
| plone-mode                   | 2012-01-08 | [[https://github.com/jone/plone-mode.el][jone/plone-mode.el]]                      | Tools for developing plone / zope / python with emacs                  |
| google-calendar              | 2011-12-29 | [[https://github.com/slaanesh/Google-Calendar-Elisp][slaanesh/Google-Calendar-Elisp]]          | Google Calender API implementation                                     |
| sync-scroll                  | 2011-12-24 | [[https://github.com/mori-dev/sync-scroll][mori-dev/sync-scroll]]                    | Scroll Up and Scroll Down 2 window                                     |
| hsearch                      | 2011-12-19 | [[https://github.com/jschaf/hsearch][jschaf/hsearch]]                          | A major mode to search Haskell                                         |
| hide-url                     | 2011-12-16 | [[https://github.com/tkf/hide-url.el][tkf/hide-url.el]]                         | Hide annoyingly long URLs                                              |
| hl-tags-mode                 | 2011-12-15 | [[https://github.com/deactivated/hl-tags-mode][deactivated/hl-tags-mode]]                | Highlight the current SGML tag context                                 |
| w3m-https-everywhere         | 2011-12-14 | [[https://github.com/k-ten/w3m-https-everywhere][k-ten/w3m-https-everywhere]]              | Encrypting your communications with a number of major websites         |
| itimer                       | 2011-12-10 | [[https://github.com/pheaver/itimer-el][pheaver/itimer-el]]                       | List and operate on emacs timers                                       |
| pgsrc                        | 2011-12-04 | [[https://github.com/dimitri/pgsrc-el][dimitri/pgsrc-el]]                        | Source Code Editing Facilities for PostgreSQL                          |
| unique-window-buffers        | 2011-12-02 | [[https://github.com/lewang/unique-window-buffers][lewang/unique-window-buffers]]            | Try to avoid showing same buffer in two windows on the same frame      |
| csr-mode                     | 2011-11-28 | [[https://github.com/trailbound/csr-mode][trailbound/csr-mode]]                     | Major mode for editing .csr files                                      |
| clojure-refactoring-mode     | 2011-11-22 | [[https://github.com/joodie/clojure-refactoring][joodie/clojure-refactoring]]              | Minor mode for basic clojure                                           |
| perlmonks                    | 2011-11-22 | [[https://github.com/metaperl/emacs-perlmonks][metaperl/emacs-perlmonks]]                | A simple interface to www.perlmonks.org                                |
| code-imports                 | 2011-11-14 | [[https://github.com/ahyatt/code-imports][ahyatt/code-imports]]                     | A module for organizing and adding to code imports                     |
| networkmanager               | 2011-11-10 | [[https://github.com/k-ten/networkmanager-el][k-ten/networkmanager-el]]                 | Define hooks which run after changing a status of network              |
| clang-lookup                 | 2011-11-06 | [[https://github.com/sheijk/clang-lookup][sheijk/clang-lookup]]                     | Goto symbol definition using clang                                     |
| popup-frame                  | 2011-11-05 | [[https://github.com/Sarcasm/popup-frame][Sarcasm/popup-frame]]                     | Popup frame management                                                 |
| posn-on-screen               | 2011-11-03 | [[https://github.com/Sarcasm/posn-on-screen][Sarcasm/posn-on-screen]]                  | Find the coordinates (x, y) around point on screen                     |
| lazarus                      | 2011-10-31 | [[https://github.com/ajvargo/Lazarus][ajvargo/Lazarus]]                         | Open recently closed files                                             |
| git-code-review              | 2011-10-30 | [[https://github.com/psanford/git-code-review-el][psanford/git-code-review-el]]             | Code review tool for Emacs                                             |
| popup+                       | 2011-10-08 | [[https://github.com/scjung/popup-plus][scjung/popup-plus]]                       | Enhancement of `popup.el'                                              |
| alore-mode                   | 2011-10-07 | [[https://github.com/JukkaL/alore-emacs][JukkaL/alore-emacs]]                      | A major mode for editing alore programs                                |
| ya-cppref                    | 2011-10-06 | [[https://github.com/whitypig/ya-cppref][whitypig/ya-cppref]]                      | An interface using w3m with cppreference.com references on Emacs       |
| remind-conf-mode             | 2011-10-02 | [[https://github.com/sshelagh/remind-conf-mode][sshelagh/remind-conf-mode]]               | A mode to help configure remind                                        |
| auto-mounter                 | 2011-09-26 | [[https://github.com/renard/auto-mount-el][renard/auto-mount-el]]                    | Manage automounts using dbus                                           |
| ert-extras                   | 2011-09-24 | [[https://github.com/mrc/ert-extras][mrc/ert-extras]]                          | Some extensions to ert                                                 |
| gdb-bp-session               | 2011-09-16 | [[https://github.com/jglee1027/gdb-bp-session][jglee1027/gdb-bp-session]]                | Save and Restore breakpoints for Emacs gdb                             |
| git-auto-commit              | 2011-09-14 | [[https://github.com/renard/git-auto-commit][renard/git-auto-commit]]                  | Git auto commit directory                                              |
| fab                          | 2011-08-24 | [[https://github.com/davidmiller/fabmacs][davidmiller/fabmacs]]                     | Fabric integration for Emacs                                           |
| projutils                    | 2011-08-17 | [[https://github.com/fgallina/projutils.el][fgallina/projutils.el]]                   | Project utils                                                          |
| ruby-comint                  | 2011-08-17 | [[https://github.com/jpablobr/ruby-comint.el][jpablobr/ruby-comint.el]]                 | Run a ruby process in a compilation buffer                             |
| erc-highlight-nicknames      | 2011-07-20 | [[https://github.com/amalloy/erc-highlight-nick][amalloy/erc-highlight-nick]]              | Highlights nicknames                                                   |
| uncrustify                   | 2011-07-14 | [[https://github.com/glima/Emacs-uncrustify][glima/Emacs-uncrustify]]                  | Apply uncrustify on buffer region                                      |
| emacs-android                | 2011-07-11 | [[https://github.com/cpc26/emacs-android][cpc26/emacs-android]]                     | Android Development with GNU/Emacs                                     |
| twittering-dframe            | 2011-07-03 | [[https://github.com/k-ten/twittering-dframe][k-ten/twittering-dframe]]                 | Dedicate frame for twittering-mode                                     |
| chicken-scheme-extras        | 2011-07-01 | [[https://github.com/xwl/chicken-scheme-extras][xwl/chicken-scheme-extras]]               | Non-standard macros and special forms support                          |
| easy-todo                    | 2011-07-01 | [[https://github.com/xwl/easy-todo][xwl/easy-todo]]                           | Manage your todos in an extremely easy way!                            |
| finkinfo-mode                | 2011-07-01 | [[https://github.com/xwl/finkinfo-mode][xwl/finkinfo-mode]]                       | Major mode for editing fink info files                                 |
| gmail-notifier               | 2011-07-01 | [[https://github.com/xwl/gmail-notifier][xwl/gmail-notifier]]                      | Notify unread gmail on mode line                                       |
| graphviz-dot                 | 2011-07-01 | [[https://github.com/xwl/graphviz-dot][xwl/graphviz-dot]]                        | Major mode for editing graphviz dot files                              |
| come-fly                     | 2011-06-26 | [[https://github.com/davidmiller/come-fly][davidmiller/come-fly]]                    | Minor mode for the Sinatra web mini-framework                          |
| codepad                      | 2011-06-22 | [[https://github.com/ruediger/emacs-codepad][ruediger/emacs-codepad]]                  | Emacs integration for codepad.org                                      |
| lilypond-hook                | 2011-06-10 | [[https://github.com/mjago/lilypond-hook][mjago/lilypond-hook]]                     | Automatically display and play lilypond Score                          |
| ezbl                         | 2011-06-02 | [[https://github.com/haxney/ezbl][haxney/ezbl]]                             | Emacs interface for Uzbl (uzbl.org)                                    |
| dedent                       | 2011-06-01 | [[https://github.com/deactivated/dedent-el][deactivated/dedent-el]]                   | Add and remove indentation during copy and paste                       |
| qtref                        | 2011-05-27 | [[https://github.com/whitypig/qtref][whitypig/qtref]]                          | An interface with Qt API reference on Emacs                            |
| trac-wiki                    | 2011-05-26 | [[https://github.com/tiborsimko/trac-wiki-el][tiborsimko/trac-wiki-el]]                 | Edit trac wiki pages in emacs via XML-RPC                              |
| vimvars                      | 2011-05-26 | [[https://github.com/jamesyoungman/vimvars][jamesyoungman/vimvars]]                   | Emacs support for VI modelines                                         |
| eproject-peepopen            | 2011-05-08 | [[https://github.com/mbarnett/eproject-peepopen][mbarnett/eproject-peepopen]]              | Graphical file chooser for Emacs on Mac OS X                           |
| find-git                     | 2011-05-08 | [[https://github.com/lieutar/find-git.el][lieutar/find-git.el]]                     | Git working tree browser                                               |
| pgsql-linum-format           | 2011-05-03 | [[https://github.com/dimitri/pgsql-linum-format][dimitri/pgsql-linum-format]]              | Dimitri Fontaine                                                       |
| pickel                       | 2011-04-20 | [[https://github.com/tlh/pickel.el][tlh/pickel.el]]                           | Elisp object serialization                                             |
| smart-todo                   | 2011-04-19 | [[https://github.com/gyordanov/smart-todo.el][gyordanov/smart-todo.el]]                 | Makes it easier to quickly add todos                                   |
| auto-complete-ya-gtags       | 2011-03-31 | [[https://github.com/whitypig/auto-complete-ya-gtags][whitypig/auto-complete-ya-gtags]]         | A source for auto-complete                                             |
| campfire                     | 2011-03-23 | [[https://github.com/timcharper/campfire-el][timcharper/campfire-el]]                  | An interface to campfire                                               |
| mark-select                  | 2011-03-21 | [[https://github.com/namikister/mark-select][namikister/mark-select]]                  | Mark and select interface                                              |
| qooxdoo                      | 2011-03-14 | [[https://github.com/jdodds/qooxdoo.el][jdodds/qooxdoo.el]]                       | Helper functions for working with qooxdoo                              |
| wubi                         | 2011-03-07 | [[https://github.com/xwl/wubi][xwl/wubi]]                                | Chinese-wubi input method in Emacs                                     |
| weather                      | 2011-03-04 | [[https://github.com/mad/weather.el][mad/weather.el]]                          | Retrieve weather                                                       |
| muse-blog                    | 2011-03-01 | [[https://github.com/jd/muse-blog.el][jd/muse-blog.el]]                         | Keep and publish a blog                                                |
| header-file                  | 2011-02-14 | [[https://github.com/0x4b/header-file-mode][0x4b/header-file-mode]]                   | Assign a major mode for header files                                   |
| nimrod-mode                  | 2011-01-25 | [[https://github.com/jameshfisher/nimrod-mode][jameshfisher/nimrod-mode]]                | A major mode for the Nimrod programming language                       |
| auto-complete-latex-light    | 2011-01-24 | [[https://github.com/tequilasunset/auto-complete-latex-light][tequilasunset/auto-complete-latex-light]] | An abbreviated version of the auto-complete-latex                      |
| recipe-mode                  | 2011-01-16 | [[https://github.com/sshelagh/recipe-mode][sshelagh/recipe-mode]]                    | A mode to make writing, finding recipes easy                           |
| yatest                       | 2011-01-13 | [[https://github.com/lieutar/yatest.el][lieutar/yatest.el]]                       | Simple test framework                                                  |
| cygstart                     | 2011-01-10 | [[https://github.com/lieutar/cygstart.el][lieutar/cygstart.el]]                     | Run Windows application associated with a file                         |
| wikidot-mode                 | 2011-01-10 | [[https://github.com/infochimps-customers/wikidot-mode][infochimps-customers/wikidot-mode]]       | Major mode for editing documents from Wikidot (http://wikidot.com)     |
| textsnip                     | 2011-01-07 | [[https://github.com/functionreturnfunction/textsnip.el][functionreturnfunction/textsnip.el]]      | Posts text to textsnip for sharing                                     |
| ical2org                     | 2011-01-06 | [[https://github.com/cofi/ical2org][cofi/ical2org]]                           | Convert icalendar to org                                               |
| powershell-mode              | 2011-01-01 | [[https://github.com/fperrin/powershell-mode][fperrin/powershell-mode]]                 | Mode for editing Powershell scripts                                    |
| framov                       | 2010-12-10 | [[https://github.com/lieutar/framov.el][lieutar/framov.el]]                       | Minor mode and any commands for Emacsen on X-Window System             |
| simo                         | 2010-12-09 | [[https://github.com/lieutar/simo.el][lieutar/simo.el]]                         | Simple image manuplation object                                        |
| qa-mode                      | 2010-12-05 | [[https://github.com/senny/qa-mode][senny/qa-mode]]                           | Major mode to edit QA files for SuperMemo                              |
| epydoc                       | 2010-11-30 | [[https://github.com/mooz/epydoc][mooz/epydoc]]                             | Pydoc interface for emacs                                              |
| echo-pick                    | 2010-11-26 | [[https://github.com/nschum/echo-pick.el][nschum/echo-pick.el]]                     | Filter for echo area status messages                                   |
| tx-mode                      | 2010-11-25 | [[https://github.com/yoshiki/tx-mode][yoshiki/tx-mode]]                         | Major mode for editing Text::Xslate syntax                             |
| string-template              | 2010-11-23 | [[https://github.com/renard/string-template-el][renard/string-template-el]]               | Support for $-substitution                                             |
| zwiebel                      | 2010-11-12 | [[https://github.com/silentbicycle/zwiebel][silentbicycle/zwiebel]]                   | Work/break interval timer                                              |
| easy-imenu-index-generator   | 2010-10-28 | [[https://github.com/tm8st/emacs-easy-imenu-index-generator][tm8st/emacs-easy-imenu-index-generator]]  | Easy implement imenu-create-index-function                             |
| mk-project                   | 2010-10-23 | [[https://github.com/mattkeller/mk-project][mattkeller/mk-project]]                   | Lightweight project handling                                           |
| yafastnav                    | 2010-10-01 | [[https://github.com/tm8st/emacs-yafastnav][tm8st/emacs-yafastnav]]                   | Yet another fastnav                                                    |
| sinasi                       | 2010-09-19 | [[https://github.com/emk/sinasi][emk/sinasi]]                              | Sinasi Is Not A SproutCore IDE                                         |
| showoff-mode                 | 2010-09-05 | [[https://github.com/developernotes/showoff-mode][developernotes/showoff-mode]]             | Major mode to edit showoff presentation files in Emacs                 |
| recs-mode                    | 2010-09-01 | [[https://github.com/tlh/recs-mode.el][tlh/recs-mode.el]]                        | [R]eg[E]xp-based [C]ommand [S]uggestion                                |
| cucumber-i18n                | 2010-08-30 | [[https://github.com/senny/cucumber-i18n.el][senny/cucumber-i18n.el]]                  | Translate i18n keys inside cucumber features                           |
| minimal                      | 2010-08-08 | [[https://github.com/dandavison/minimal][dandavison/minimal]]                      | Minimalist Emacs appearance                                            |
| wordnik                      | 2010-07-03 | [[https://github.com/hober/wordnik-el][hober/wordnik-el]]                        | Client library for the Wordnik API                                     |
| diff-git                     | 2010-06-30 | [[https://github.com/alanfalloon/diff-git.el][alanfalloon/diff-git.el]]                 | Git integration with diff-mode                                         |
| cl-merge                     | 2010-06-20 | [[https://github.com/haxney/cl-merge][haxney/cl-merge]]                         | Add a `cl-merge-struct' function                                       |
| popup-global-mark-ring       | 2010-06-04 | [[https://github.com/whitypig/popup-global-mark-ring][whitypig/popup-global-mark-ring]]         | Jumping Interactively through global mark ring                         |
| keats                        | 2010-04-18 | [[https://github.com/rejeep/keats][rejeep/keats]]                            | Keybinding Cheats                                                      |
| cn-outline                   | 2010-03-22 | [[https://github.com/mori-dev/cn-outline][mori-dev/cn-outline]]                     | Minor mode for column-number-base line folding                         |
| flowtimer                    | 2010-03-04 | [[https://github.com/jrockway/time-utils-el][jrockway/time-utils-el]]                  | Let yourself work in sprints                                           |
| modelica-mode                | 2010-02-17 | [[https://github.com/modelica-tools/modelica-mode][modelica-tools/modelica-mode]]            | Major mode for editing Modelica files                                  |
| mythryl-mode                 | 2010-02-11 | [[https://github.com/phr/mythryl-mode][phr/mythryl-mode]]                        | Major mode for editing Mythryl code                                    |
| epom                         | 2010-02-10 | [[https://github.com/aufrank/epom][aufrank/epom]]                            | Pomodoro time management in emacs                                      |
| antlr-runtime                | 2010-02-08 | [[https://github.com/olabini/antlr-elisp][olabini/antlr-elisp]]                     | Antlr runtime                                                          |
| mysql                        | 2010-02-06 | [[https://github.com/haxney/mysql][haxney/mysql]]                            | Mysql front-end                                                        |
| taskpaper                    | 2010-02-01 | [[https://github.com/jonasoberschweiber/taskpaper-el][jonasoberschweiber/taskpaper-el]]         | Taskpaper implementation for Emacs                                     |
| etest                        | 2009-12-31 | [[https://github.com/philjackson/etest][philjackson/etest]]                       | Run tests and get back a hierarchical set of results                   |
| tmt-mode                     | 2009-12-04 | [[https://github.com/yoshiki/tmt-mode][yoshiki/tmt-mode]]                        | Major mode for editing Text::MicroTemplate syntax                      |
| key-cast                     | 2009-12-02 | [[https://github.com/k1LoW/emacs-key-cast][k1LoW/emacs-key-cast]]                    | Key comannd casting interface                                          |
| foursquare                   | 2009-11-18 | [[https://github.com/hober/foursquare-el][hober/foursquare-el]]                     | Foursquare client for Emacs                                            |
| stickies                     | 2009-11-14 | [[https://github.com/tkosaka/emacs-lisp-stickies][tkosaka/emacs-lisp-stickies]]             | Stickies                                                               |
| acme-mouse                   | 2009-09-10 | [[https://github.com/akrito/acme-mouse][akrito/acme-mouse]]                       | Mouse-button chording                                                  |
| fuzzyjump                    | 2009-04-27 | [[https://github.com/tomoya/fuzzyjump.el][tomoya/fuzzyjump.el]]                     | Jump to where you (almost) want                                        |
| yammer                       | 2009-04-25 | [[https://github.com/psanford/emacs-yammer][psanford/emacs-yammer]]                   | Simple tool for accessing yammer.com                                   |
| elk-test                     | 2009-04-18 | [[https://github.com/nschum/elk-test][nschum/elk-test]]                         | Emacs Lisp testing framework                                           |
| rotate-text                  | 2009-04-13 | [[https://github.com/nschum/rotate-text.el][nschum/rotate-text.el]]                   | Cycle through words, symbols and patterns                              |
| doc-mode                     | 2009-04-10 | [[https://github.com/nschum/doc-mode][nschum/doc-mode]]                         | Convenient editing of in-code documentation                            |
| compile-bookmarks            | 2009-04-07 | [[https://github.com/nschum/compile-bookmarks.el][nschum/compile-bookmarks.el]]             | Bookmarks for compilation commands                                     |
| recent-addresses             | 2009-04-05 | [[https://github.com/nschum/recent-addresses.el][nschum/recent-addresses.el]]              | Store and recall recently used email addresses                         |
| tempo-snippets               | 2009-03-31 | [[https://github.com/nschum/tempo-snippets.el][nschum/tempo-snippets.el]]                | Visual insertion of tempo templates                                    |
| yql                          | 2009-03-09 | [[https://github.com/wfarr/yql-el][wfarr/yql-el]]                            | Emacs Lisp library for accessing YQL                                   |
| autocompletion-php-functions | 2009-01-26 | [[https://github.com/ashizawa/autocompletion-php-functions][ashizawa/autocompletion-php-functions]]   | Auto complete php functions                                            |
| html-key-chord-mode          | 2009-01-24 | [[https://github.com/tomoya/html-key-chord-mode][tomoya/html-key-chord-mode]]              | Support html tagging key chord                                         |
| xyzzy                        | 2009-01-16 | [[https://github.com/tomoya/xyzzy.el][tomoya/xyzzy.el]]                         | Can use the function with built-in xyzzy                               |
| ditz                         | 2008-11-05 | [[https://github.com/kentaro/emacs-ditz][kentaro/emacs-ditz]]                      | Emacs interface to Ditz issue tracking system                          |
| iswitch-menu                 | 2008-10-14 | [[https://github.com/joodie/iswitch-menu][joodie/iswitch-menu]]                     | Use iswitch to access menus                                            |
| highrise                     | 2008-08-18 | [[https://github.com/hober/37emacs][hober/37emacs]]                           | Client for 37Signals' Highrise API                                     |
| gitsum                       | 2008-08-09 | [[https://github.com/chneukirchen/gitsum][leahneukirchen/gitsum]]                   | Basic darcsum feelalike for Git                                        |

** Gitlab
#+name: missing-gitlab
#+begin_src emacs-lisp
  (epkg-with-org-header ("Package" "Link")
    (--keep (and (not (melpa-get it))
                 (not (gelpa-get it))
                 (list it (epkg-org-link it)))
            (epkgs 'name 'epkg-gitlab-package)))
#+end_src
#+results: missing-gitlab
| Package (2)                | Link                                 |
|----------------------------+--------------------------------------|
| org-attach-embedded-images | [[https://gitlab.com/marcowahl/org-attach-embedded-images][marcowahl/org-attach-embedded-images]] |
| ox-rss                     | [[https://gitlab.com/nsavage/ox-rss][nsavage/ox-rss]]                       |

** Git
#+name: missing-git
#+begin_src emacs-lisp
  (epkg-with-org-header ("Package" "Link")
    (--keep (and (not (melpa-get it))
                 (not (gelpa-get it))
                 (list it (epkg-org-link it)))
	    (epkgs 'name 'epkg-git-package)))
#+end_src
#+results: missing-git
| Package (9)   | Link                                       |
|---------------+--------------------------------------------|
| ebuild-mode   |                                            |
| elpa-admin    |                                            |
| goldendict    | [[https://repo.or.cz/goldendict.el.git]]       |
| mailscripts   |                                            |
| ob-sclang     | [[https://repo.or.cz/ob-sclang.git]]           |
| org-link-edit | [[https://git.kyleam.com/org-link-edit/about]] |
| piem          | [[https://git.kyleam.com/piem/about]]          |
| python-pep8   |                                            |
| python-pylint |                                            |

